const data = {
    clubs: [{
        id: 0,
        name: "ОЛИМП",
        lat: 59.9565737389786,
        lon: 30.3093735,
        img: "https://moika78.ru/news2/2019/01/itmo.jpg",
        isSubscribe: false,
        events: [
            {
                id: 0,
                name: "Робототехника",
                day: 20,
                time: "18:00",
                description: " Робототехника — не просто отрасль, но технология общего назначения, подобно электричеству, транспорту или канализации. Экономические исследования показывают, что роботизация имеет такой же трансформационный эффект на экономику, какой оказало изобретение паровой машины в эпоху первой промышленной революции в 18 веке.\n" +
                    "Для России важно поддерживать собственную отрасль робототехники, так как роботы действительно замещают рабочие места. Однако впервые в истории нашей цивилизации профессии в одной стране могут замещать роботы, созданные в другой.",
                isSubscribed: false
            },
            {
                id: 1,
                name: "Робототехника",
                day: 24,
                time: "16:00",
                description: "Робототехника — не просто отрасль, но технология общего назначения, подобно электричеству, транспорту или канализации. Экономические исследования показывают, что роботизация имеет такой же трансформационный эффект на экономику, какой оказало изобретение паровой машины в эпоху первой промышленной революции в 18 веке.\n" +
                    "Для России важно поддерживать собственную отрасль робототехники, так как роботы действительно замещают рабочие места. Однако впервые в истории нашей цивилизации профессии в одной стране могут замещать роботы, созданные в другой.",
                isSubscribed: false
            },
            {
                id: 2,
                name: "Программирование",
                day: 24,
                time: "18:00",
                description: "Сегодня слово «Программирование» можно увидеть / услышать, как в какой-нибудь вирусной рекламе в социальной сети, так и в литературном или кинематографическом произведении. Однако что такое программирование и кто такие программисты? Не мудрствуя лукаво, можно поступить как матерый кодер и загуглить новое слово.",
                isSubscribed: false
            },
        ]
    },
        {
            id: 1,
            name: "Шило",
            lat: 59.84131121241666,
            lon: 30.392812171761317,
            img: "https://kitchendecorium.ru/wp-content/uploads/2015/05/shite-s-detmi.jpg",
            isSubscribe: false,
            events: [
                {
                    id: 0,
                    name: "Вышивание крестиком",
                    day: 24,
                    time: "18:00",
                    description: "Шитьё — вид ручного труда.\n" +
                        "Представляет собой создание на материале (ткани, коже) стежков и швов при помощи иглы и ниток, лески и тому подобного. Одно из древнейших технологий производства, возникшее ещё в каменном веке. До изобретения пряжи и тканных материалов одежда шилась из меха и шкур добытых животных с помощью игл из кости или рогов и «нитей» из сухожилий, вен или кишок животных.",
                    isSubscribed: false
                },
            ]
        },
        {
            id: 2,
            name: "Шейка",
            lat: 59.94628330196837,
            lon: 30.275210910635337,
            img: "https://i.ytimg.com/vi/cebt9FBSFVI/maxresdefault.jpg",
            isSubscribe: false,
            events: [
                {
                    id: 0,
                    name: "Вышивание крестиком",
                    day: 24,
                    time: "18:00",
                    description: "Шитьё — вид ручного труда.\n" +
                        "Представляет собой создание на материале (ткани, коже) стежков и швов при помощи иглы и ниток, лески и тому подобного. Одно из древнейших технологий производства, возникшее ещё в каменном веке. До изобретения пряжи и тканных материалов одежда шилась из меха и шкур добытых животных с помощью игл из кости или рогов и «нитей» из сухожилий, вен или кишок животных.",
                    isSubscribed: false
                },
            ]
        }, {
            id: 4,
            name: "Программировать - весело!",
            lat: 59.94052466728044,
            lon: 30.256859660895522,
            img: "https://python-scripts.com/wp-content/uploads/2019/01/object-oriented-programming-in-python.png",
            isSubscribe: false,
            events: [
                {
                    id: 0,
                    name: "Дебажим код весело",
                    day: 24,
                    time: "18:00",
                    description: "debug — Программа-отладчик, которую используют для проверки и отладки выполняемых файлов. Использовалась при операционной системе DOS. Под более поздние версии операционных систем работает через эмулятор DOS и имеет ограниченные возможности. Также иногда называют процесс отладки программы. ",
                    isSubscribed: false
                },

                {
                    id: 0,
                    name: "Тестируем код после корпоратива",
                    day: 25,
                    time: "18:00",
                    description: "Тести́рование програ́ммного обеспе́че́ния — процесс исследования, испытания программного продукта, имеющий своей целью проверку соответствия между реальным поведением программы и её ожидаемым поведением на конечном наборе тестов, выбранных определённым образом (ISO/IEC TR 19759:2005)[1]. ",
                    isSubscribed: false
                },
            ]
        },
        {
            id: 3,
            name: "Musical Arena",
            lat: 59.945064385180196,
            lon: 30.358768808955467,
            img: "https://rockcult.ru/wp-content/uploads/2019/08/K1774-Slipknot-cover-header.jpg",
            isSubscribe: false,
            events: [
                {
                    id: 0,
                    name: "Hard&Buss",
                    day: 21,
                    time: "18:00",
                    description:  "Hard Bass School (Школа Танцев Хардбаса) - Под этим именем вот уже несколько лет Российские мьюзик мейкеры Павел Жуков и Валь Толетов выпускают в свет свои провокационные композиции, которые полюбились слушателю в каждом уголке нашей планеты. Неоднократные участники крупных вечеринок и масштабных рейвов в России и далеко за её пределами. Треки парней получили поддержку от самых значимых фигур стиля, взорвав танцполы всех без исключения Pumping/Hardbass вечеринок, попутно становясь саундтреками к таким хитовым фильмам как \"Околофутбола\",\"Черная Вода\",\"Training Day (WARNER)\", и гремя с экранов телевизоров в различных ТВ-Шоу стран Европы и Америки.Глобальные уличные флешмобы под треки HBS доходили порой до безумия, набирая миллионы просмотров на YouTube!\n" +
                        "Hard Bass School стали олицетворением Русского андеграунда! Теперь, говоря \"Хардбас\", многие имеют ввиду треки этих парней!",
                    isSubscribed: false
                },
                {
                    id: 3,
                    name: "Гитара",
                    day: 22,
                    time: "19:00",
                    description: "Гита́ра[1] — струнный щипковый музыкальный инструмент. Применяется в качестве аккомпанирующего или сольного инструмента во многих стилях и направлениях музыки, среди которых романс, блюз, кантри, фламенко, рок, джаз. Изобретённая в XX веке электрическая гитара произвела значительные изменения в музыке и тем самым оказала сильное влияние на массовую культуру. ",
                    isSubscribed: false
                },
                {
                    id: 1,
                    name: "Drum destroy",
                    day: 24,
                    time: "18:00",
                    description:  "Уда́рная устано́вка (барабанная установка, жарг. кухня, англ. drumkit[1]) — набор барабанов, тарелок и других ударных инструментов, приспособленный для удобной игры музыканта-барабанщика. Обычно используется в джазе, блюзе, роке и поп-музыке.\n" +
                        "\n" +
                        "По отдельным инструментам установки играют барабанными палочками, различными щётками и колотушками. Для игры на хай-хэте и бас-барабане используются педали, поэтому барабанщик играет, сидя на специальном стуле или табурете.\n" +
                        "\n" +
                        "Разные жанры музыки диктуют стилистически соответствующий состав инструментов в барабанной установке. ",
                    isSubscribed: false
                },
                {
                    id: 2,
                    name: "Пианино",
                    day: 21,
                    time: "20:00",
                    description: "Пиани́но (итал. pianino, дословно: маленькое фортепиано) — клавишный музыкальный инструмент с ударным (молоточковым) способом звукоизвлечения, созданный специально для комнатного музицирования в небольших помещениях. Пианино представляет собой уменьшенную по размеру разновидность фортепиано, в которой струны, дека и механическая часть расположены вертикально, а не горизонтально, вследствие чего пианино занимает гораздо меньше места, чем рояль. ",
                    isSubscribed: false
                },
            ]
        }]
};

export function findAll() {
    return data.clubs;
}


export function findClubById(id) {
    return data.clubs.find(it => {
        if (it.id == id)
            return true;

        return false;
    });
}

export function findEventById(clubId, eventId) {
    const club = findClubById(clubId);
    if (!club)
        return undefined;

    return club.events.find(it => {
        if (it.id == eventId)
            return true;

        return false;
    });
}

export function subscribeToEventById(clubId, eventId) {
    let clubIndex = data.clubs.findIndex(it => {
        return it.id == clubId;
    });

    let eventIndex = data.clubs[clubIndex].events.findIndex(it => {
        return it.id == eventId;
    });

    data.clubs[clubIndex].events[eventIndex].isSubscribed = true
}

export default data;
